app/channels/chat_room_channel.rb

  def speak(data)
    data_type= 'message'
    @message_log = MessageLog.new(username: data['name'],body: data['message'], jenis: data_type)
    if @message_log.save
---
INSERT INTO "message_logs" ("username", "body", "created_at", "updated_at", "jenis") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "Rim"], ["body", "selamat pagi semua"], ["created_at", "2020-12-13 12:39:02.970511"], ["updated_at", "2020-12-13 12:39:02.970511"], ["jenis", "message"]]

  def announce(data)
    data_type= 'announce'
    @message_log = MessageLog.new(username: data['name'],body: data['type'], jenis: data_type)
    if @message_log.save
---
INSERT INTO "message_logs" ("username", "body", "created_at", "updated_at", "jenis") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "Rim"], ["body", "join"], ["created_at", "2020-12-13 12:38:52.980981"], ["updated_at", "2020-12-13 12:38:52.980981"], ["jenis", "announce"]]