app/controllers/home_controller.rb

  def index
    @message_logs = MessageLog.all
---
SELECT "message_logs".* FROM "message_logs"